def main(txt):
    key = 0
    if txt in ['ก' ,'ด' ,'ถ' ,'ท' ,'ภ']:
        key = 1
    elif txt in ['ข' ,'บ' ,'ป' ,'ง' ,'ช']:
        key = 2
    elif txt in ['ต' ,'ฒ' ,'ฆ']:
        key = 3
    elif txt in ['ค' ,'ธ' ,'ร' ,'ญ' ,'ษ']:
        key = 4
    elif txt in ['ฉ' ,'ณ' ,'ฌ' ,'น' ,'ม' ,'ห' ,'ฮ' ,'ฎ' ,'ฬ']:
        key = 5
    elif txt in ['จ' ,'ล' ,'ว' ,'อ']:
        key = 6
    elif txt in ['ศ' ,'ส']:
        key = 7    
    elif txt in ['ย' ,'ผ' ,'ฝ' ,'พ' ,'ฟ']:
        key = 8
    elif txt in ['ฐ']:
        key = 9
    elif txt in ['ฃ' ,'ฅ' ,'ซ' ,'ฏ' ,'ฑ']:
        key = 0
    return key

def carnumber(home_1):
    home_2 = list(home_1)
    str_ = []
    for i in home_2:
        if i.isalpha():
            key = main(i)
            str_.append(key)
        else:
            key_1 = int(i)
            str_.append(key_1)
    str_1 = tuple(str_)
    cal_3 = str_1
    if len(cal_3) == 1:
        cal_2 = int(cal_3)
    elif len(cal_3) == 2:
        cal_2 = int(cal_3[0])+int(cal_3[1])
    elif len(cal_3) == 3:
        cal_2 = int(cal_3[0])+int(cal_3[1])+int(cal_3[2])
    elif len(cal_3) == 4:
        cal_2 = int(cal_3[0])+int(cal_3[1])+int(cal_3[2])+int(cal_3[3])
    elif len(cal_3) == 5:
        cal_2 = int(cal_3[0])+int(cal_3[1])+int(cal_3[2])+int(cal_3[3])+int(cal_3[4])
    elif len(cal_3) == 6:
        cal_2 = int(cal_3[0])+int(cal_3[1])+int(cal_3[2])+int(cal_3[3])+int(cal_3[4])+int(cal_3[5])
    elif len(cal_3) == 7:
        cal_2 = int(cal_3[0])+int(cal_3[1])+int(cal_3[2])+int(cal_3[3])+int(cal_3[4])+int(cal_3[5])+int(cal_3[6])
    cal_5 = str(cal_2)
    if len(cal_5) == 1:
        cal_4 = int(cal_5)
    elif len(cal_5) != 1:
        cal_4 = int(cal_5[0])+int(cal_5[1])
    if cal_4 == 1:
        mes = "อำนาจบารมีและยศฐาบรรดาศักดิ์ \n เป็นคนเฮฮา สนุกสนาน ชอบท่องเที่ยว หรือไปไหนมาไหนกับครอบครัว เพื่อนฝูง แต่บางครั้งก็โลกส่วนตัวสูงเหมือนกัน\
            ขับรถมั่นใจแต่ถ้าโมโหแล้วจะใจร้อนมาก เหมาะสำหรับคนมียศมีตำแหน่ง ข้าราชการ ผู้มีอำนาจวาสนา หรือผู้ทีต้องการเสริมอำนาจวาสนา"
    elif cal_4 == 2:
        mes = "ความสวยงามแและความรัก \n เป็นคนมีความอ่อนโยน ชอบขับรถเรื่อย ๆ ชิว ๆ เป็นมิตรกับเพื่อนรวมทาง เน้นการตัดสินใจช้าแต่ชัวร์ไว้ก่อน การเงินค่อนข้างดี\
            ชอบความสวย ความงามเหมาะกับผู้หญิง คนทำงานด้านบริการ การเงิน การค้าขาย ช่วยส่งเสริมด้านการเงิน"
    elif cal_4 == 3:
        mes = "ความเข้มแข็งและความกล้าหาญ \n เป็นคนที่มีพลังสูง เป็นคนลุย ๆ ถึงไหนถึงกัน มักขับรถด้วยความเร็วสูง หรือเป็นคนใจร้อนจึงต้องมีสติ\
            ระมัดระวังอยู่เสมอ เลขนี้เหมาะกับผู้ชายมากกว่าผู้หญิง เหมาะสำหรับคนทำงานในเครื่องแบบ ตำรวจ ทหาร หมอ เป็นต้น"
    elif cal_4 == 4:
        mes = "การเจรจา การติดต่อและการค้าขาย \n มีพลังส่งเสริมด้านการพูด การเจรา การติดต่อสื่อสาร การประสานงาน ประชาสัมพันธ์\
            เหมาะสำหรับคนที่ทำงานด้านการติดต่อสื่อสาร ไม่ว่าจะเป็นนักพูด นักร้อง พิธีกรนักเขียน ผู้สื่อข่าว นักประชาสัทพันธ์  หรืออาชีพใด ๆ ก็ตาม ที่ต้องเน้นการเจราต่อรอง"
    elif cal_4 == 5:
        mes = "สติปัญญาและความน่าเชื่อถือ \n มีพลังส่งเสริมด้านสติปัญญา เรื่องการศึกษา เป็นคนใจเย็น ดูน่าเชื่อถือ เหมาะสำหรับทุกคนแต่จะเด่นกับคนที่ต้องอาศัยเครดิต\
            ความไว้วางใจ หรืองานที่ใช้ความรู้เชิงลึก และคนที่ทำงานด้านการศึกษาศาลยุติธรรม หมอ พยาบาล ครู อาจารย์ การค้าขายที่ต้องใช้ความรู้ความเชี่ยวชาญ"
    elif cal_4 == 6:
        mes = "ความสุข ความสงบ \n มีพลังส่งเสริมเรื่องคนอุปถัมภ์ คนเมตตาเอ็นดู ส่งเสริมเรื่องการงาน การเงินและความรัก เป็นคนที่มีรสนิยมดี เหมาะสำหรับคนทำงานด้านการบันเทิง\
            เสริมสวย ขายของสวยงาม"
    elif cal_4 == 7:
        mes = "ความทุกข์และอุปสรรคในชีวิต \n มีพลังส่งผลกระทบเรื่องการเสียทรัพย์ มีอุปสรรคในชีวิต หรือเกิดอุบัติเหตุได้ง่ายมักจะเกิดผลเสียด้านการเงิน\
            เหมาะสำหรับคนที่ทำอาชีพด้านเกษตรกรรม การขนส่ง อาชีพที่ต้องใช้ความอดทน หรือ โปรเจ็คต์ระยะยาว"
    elif cal_4 == 8:
        mes = "การเงินและความใจร้อน \n มีพลังเสริมด้านการเงิน การค้าขาย เป้นคนที่ คิดไว ทำไว มือไว ปากไว ถึงไหนถึงกันจนอาจจะก่อให้เกิดผลเสีย เพราะใจร้อน มุทะลุ หรือขาดสติได้ เหมาะสำหรับคนทำงานกลางคืน\
            อาชีพเสี่งอันตรายหรืออาชีพสีเทา"
    else:
        mes = "อายุยืนและสิ่งศักดิ์สิทธิ์คุ้มครอง \n ส่งเสริมให้เกิดความคล่องแคล่วในทุก ๆ ด้าน ไม่ว่าจะเป็นด้านการงาน การเงิน ความมั่นคั่ง มั่นคง อายุยืน สิ่งศักดิ์สิทธิ์คุ้มครองตลอดเวลา เหมาะกับทุก ๆ คน\
            เพราเป็นเลขดี เลขมงคล"
    return mes

def percarnumber(home_1):
    home_2 = list(home_1)
    numset = []
    for i in home_2:
        if i.isalpha():
            key = main(i)
            numset.append(key)
        else:
            key_1 = int(i)
            numset.append(key_1)    
    if len(numset)%2 != 0:
        numset.pop(0)
    if len(numset) == 2: #สองตัว
        num_1 = str(numset[0])+str(numset[1])
        positive = ('15' , '51', '22', '23', '32', '24', '42', '26', '62', '28', '82', '29', '92', '35', '53', '36', '63', '45', '54', '49', '94', '55', '89', '98', '95', '59', '99')
        list_pos = list(positive)
        negative = ('01', '10', '02', '20', '30', '03', '13', '31', '12', '21', '17', '71', '37', '73', '38', '83', '33', '60', '06', '67', '76', '11', '19', '91', '77', '93', '39', '35', '53', '36', '63', '11', '19', '91')
        list_neg = list(negative)
        if num_1 in list_pos:
            num_3 = 1
        elif num_1 in list_neg:
            num_3 = 0
        else:
            num_3 = 0.5
        weight = (int(num_3)*100)
    elif len(numset) == 4: #สี่ตัว
        num_1 = str(numset[0])+str(numset[1])
        num_2 = str(numset[2])+str(numset[3])
        positive = ('15' , '51', '22', '23', '32', '24', '42', '26', '62', '28', '82', '29', '92', '35', '53', '36', '63', '45', '54', '49', '94', '55', '89', '98', '95', '59', '99')
        list_pos = list(positive)
        negative = ('01', '10', '02', '20', '30', '03', '13', '31', '12', '21', '17', '71', '37', '73', '38', '83', '33', '60', '06', '67', '76', '11', '19', '91', '77', '93', '39', '35', '53', '36', '63', '11', '19', '91')
        list_neg = list(negative)
        if num_1 in list_pos:
            num_3 = 1
        elif num_1 in list_neg:
            num_3 = 0
        else:
            num_3 = 0.5
        if num_2 in list_pos:
            num_4 = 1
        elif num_2 in list_neg:
            num_4 = 0
        else:
            num_4 = 0.5
        weight = (((num_3+num_4)/2)*100)
    elif len(numset) == 6: #หกตัว
        num_1 = str(numset[0])+str(numset[1])
        num_2 = str(numset[2])+str(numset[3])
        num_7 = str(numset[4])+str(numset[5])
        positive = ('15' , '51', '22', '23', '32', '24', '42', '26', '62', '28', '82', '29', '92', '35', '53', '36', '63', '45', '54', '49', '94', '55', '89', '98', '95', '59', '99')
        list_pos = list(positive)
        negative = ('01', '10', '02', '20', '30', '03', '13', '31', '12', '21', '17', '71', '37', '73', '38', '83', '33', '60', '06', '67', '76', '11', '19', '91', '77', '93', '39', '35', '53', '36', '63', '11', '19', '91')
        list_neg = list(negative)
        if num_1 in list_pos:
            num_3 = 1
        elif num_1 in list_neg:
            num_3 = 0
        else:
            num_3 = 0.5
        if num_2 in list_pos:
            num_4 = 1
        elif num_2 in list_neg:
            num_4 = 0
        else:
            num_4 = 0.5
        if num_7 in list_pos:
            num_6 = 1
        elif num_4 in list_neg:
            num_6 = 0
        else:
            num_6 = 0.5
        weight = int((((num_3+num_4+num_6)/3)*100))
    return weight, 100 - weight